oviyatech/STM32Source/IMXBLACK_SW/Utilities/SramNAND/Nand_MT29F1G08/Fsmc_Nand.c
/******************** (C) COPYRIGHT 2010 STMicroelectronics ********************
* File Name          : fsmc_nand.c
* Author             : MCD Application Team
* Version            : V3.2.1
* Date               : 07/05/2010
* Description        : This file provides a set of functions needed to drive the
*                      NAND512W3A2 memory mounted on STM3210E-EVAL board.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fsmc_nand.h"
#include "stm32f4xx_fsmc.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx.h"  
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/



/* Private macro -------------------------------------------------------------*/
#define ROW_ADDRESS (Address.Page + (Address.Block + (Address.Zone * NAND_ZONE_SIZE)) * NAND_BLOCK_SIZE)

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
* Function Name  : FSMC_NAND_Init
* Description    : Configures the FSMC and GPIOs to interface with the NAND memory.
*                  This function must be called before any write/read operation
*                  on the NAND.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void FSMC_MT29F1_NAND_Init(void)
{
	
#if 1    //STM32F4xx
   
	  GPIO_InitTypeDef GPIO_InitStructure; 
    FSMC_NANDInitTypeDef FSMC_NANDInitStructure;
    FSMC_NAND_PCCARDTimingInitTypeDef  p;
   
    /* Clock to the IOs that are involved in the FSMC module */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE | 
                           RCC_AHB1Periph_GPIOG, ENABLE);    
    
    /* Enable FSMC clock */
    RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);    
    
    /* some default values */
    GPIO_StructInit (&GPIO_InitStructure);
    /*-- GPIO Configuration OUTPUT Lines -----------------------------*/
    /*!< CLE, ALE, D0->D3, NOE, NWE and NCE2  NAND pin configuration  */
    /* GPIOD configuration */
    GPIO_PinAFConfig(GPIOD, NAND_CLE_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_ALE_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_D0_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_D1_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_D2_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_D3_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_NOE_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_NWE_s, GPIO_AF_FSMC); 
    //GPIO_PinAFConfig(GPIOD, NAND_NWAIT_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOD, NAND_NWAIT_s, GPIO_AF_SDIO);
    
    GPIO_InitStructure.GPIO_Pin =  NAND_CLE | NAND_ALE | NAND_D0 | NAND_D1 |  
                                   NAND_D2 | NAND_D3 | NAND_NOE | NAND_NWE /*NAND_NWAIT*/;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;    /* FSMC, Alternate function */    
    /* configure */
    GPIO_Init(GPIOD, &GPIO_InitStructure); 
 
    GPIO_InitStructure.GPIO_Pin =  NAND_NWAIT;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;    /* As an input */    
    /* configure */
    GPIO_Init(GPIOD, &GPIO_InitStructure);
 
    /*!< D4->D7 NAND pin configuration  */  
    GPIO_PinAFConfig(GPIOE, NAND_D4_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOE, NAND_D5_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOE, NAND_D6_s, GPIO_AF_FSMC);
    GPIO_PinAFConfig(GPIOE, NAND_D7_s, GPIO_AF_FSMC);
    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;    /* FSMC, Alternate function */  
    GPIO_InitStructure.GPIO_Pin = NAND_D4 | NAND_D5 | NAND_D6 | NAND_D7;    
    /* configure */
    GPIO_Init(GPIOE, &GPIO_InitStructure);
    
		/*!< Chip select for FSMC Bank 2 */  
    GPIO_PinAFConfig(GPIOG, NAND_NCE2_s, GPIO_AF_FSMC);
    GPIO_InitStructure.GPIO_Pin = NAND_NCE2;    
    /* configure */
    GPIO_Init(GPIOD, &GPIO_InitStructure);
		
#if 0 //CE-3		
    /*!< Chip select for FSMC Bank 3 */  
    GPIO_PinAFConfig(GPIOG, NAND_NCE3_s, GPIO_AF_FSMC);
    GPIO_InitStructure.GPIO_Pin = NAND_NCE3;    
    /* configure */
    GPIO_Init(GPIOG, &GPIO_InitStructure);
#endif  //CE-3

    /*-- FSMC Configuration ------------------------------------------------------*/
    FSMC_NANDInitStructure.FSMC_CommonSpaceTimingStruct = &p;
    FSMC_NANDInitStructure.FSMC_AttributeSpaceTimingStruct = &p;
    FSMC_NANDStructInit (&FSMC_NANDInitStructure);
    /* overwrite defaults */
    p.FSMC_SetupTime = 0x0;
    p.FSMC_WaitSetupTime = 0x2;
    p.FSMC_HoldSetupTime = 0x1;
    p.FSMC_HiZSetupTime = 0x0;
 
		 /* NAND is connected to Bank 2 Chip Select */
		FSMC_NANDInitStructure.FSMC_Bank = FSMC_Bank2_NAND ; 
    FSMC_NANDInitStructure.FSMC_Waitfeature = FSMC_Waitfeature_Enable;
    FSMC_NANDInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_8b;
    /* NAND in used has built in ECC, 5 bit detection and 4 bit correction */
    FSMC_NANDInitStructure.FSMC_ECC = FSMC_ECC_Disable;    
    FSMC_NANDInitStructure.FSMC_TCLRSetupTime = 0x00;
    FSMC_NANDInitStructure.FSMC_TARSetupTime = 0x00;
    /* Commit the FSMC settings */ 
    FSMC_NANDInit(&FSMC_NANDInitStructure);
 
